run/gasAtomization/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "./initialConditions"

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    gasInlet
    {
        type        fixedValue;
        value		uniform $TAtomizationGas;
    }
    meltInlet
    {
    	type		fixedValue;
        value       uniform $meltInletTemperature;
    }
    cylinder
    {
        type        zeroGradient;
    }
    outlet
    {
    	type		zeroGradient;
    }
    symmetry1
    {
        type        symmetry;
    }
    symmetry2
    {
        type        symmetry;
    }
    nozzleWalls
    {
	    type		zeroGradient;
    }

}


// ************************************************************************* //
