run/gasAtomization/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "./initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    gasInlet
    {
        type        turbulentIntensityKineticEnergyInlet;
        intensity   0.1;
        value       uniform 1;
    }
    meltInlet 
    {
    	type        turbulentIntensityKineticEnergyInlet;
        intensity   0.05;
        value       uniform 1;
    }
    cylinder
    {
        type        zeroGradient;
    }
    outlet
    {
    	type		zeroGradient;
    }
    symmetry1
    {
        type        symmetry;
    }
    symmetry2
    {
        type        symmetry;
    }
    nozzleWalls
    {
	    type        fixedValue;
	    value       uniform 0;
    }

}

// ************************************************************************* //
