run/gasAtomization/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "./initialConditions"

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform $pAtm;

boundaryField
{
    gasInlet
    {
        type        calculated;
	    value		uniform $pAtomizationGas;
    }
    meltInlet
    {
    	type		zeroGradient;
    }
    cylinder
    {
        type        zeroGradient;
    }
    outlet
    {
    	type        zeroGradient;
    }
    symmetry1
    {
        type        symmetry;
    }
    symmetry2
    {
        type        symmetry;
    }
    nozzleWalls
    {
	    type		zeroGradient;
    }

}

// ************************************************************************* //
