run/gasAtomization/system/FOs/FOextractEulerian
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

dropletPlane_20mm
{
	type	extractEulerianParticlesAMR;
	libs	(myFieldFunctionObjects);
	faceZone Hplane_20mm;
	alpha	alpha.melt;
	alphaThreshold 1e-8;

	writePrecision	6;
	writeToFile	true;
	useUserTime	false;
	enabled		true;
	log		true;
	writeControl	writeTime;
}

dropletPlane_25mm
{
	type	extractEulerianParticlesAMR;
	libs	(myFieldFunctionObjects);
	faceZone Hplane_25mm;
	alpha	alpha.melt;
	alphaThreshold 1e-8;

	writePrecision	6;
	writeToFile	true;
	useUserTime	false;
	enabled		true;
	log		true;
	writeControl	writeTime;
}

dropletPlane_30mm
{
        type    extractEulerianParticlesAMR;
        libs    (myFieldFunctionObjects);
        faceZone Hplane_30mm;
        alpha   alpha.melt;
	alphaThreshold 1e-8;

        writePrecision  6;
        writeToFile     true;
        useUserTime     false;
        enabled         true;
        log             true;
        writeControl    writeTime;
}


// ************************************************************************* //
