run/gasAtomization/system/FOs/FOliquidMass
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

liquidMass
{
    type            multiply;
    libs            (fieldFunctionObjects);
    fields          (alpha.melt thermo:rho.melt);
	executeControl  timeStep;
    executeInterval 1;
    writeControl    writeTime;
	log				false;
}

totalLiquidMass
{
 	type            volFieldValue;
    libs            (fieldFunctionObjects);
    operation	volIntegrate;
    fields
	(
        multiply(alpha.melt,thermo:rho.melt)
    );
	writeFields     false;
    enabled 		true;
    log             false;
    valueOutput     true;
}
// ************************************************************************* //
