run/gasAtomization/system/FOs/FOugas
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

Ugas
{
	type		multiply;
	libs		(fieldFunctionObjects);
	fields		(alpha.gas U);

	result 		Ugas;
	enabled		true;
	executeControl	timeStep;
	executeInterval	1;
	writeControl	writeTime;
}

// ************************************************************************* //
