run/gasAtomization/system/FOs/FOvtpsurfaces
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
vtpsurfaces
    {
        type            surfaces;
        libs            (geometricVoF sampling);
        writeControl    runTime;
        writeInterval   $writeVTPSurfaceEvery;

        surfaceFormat   vtp;
        fields          (T);

        interpolationScheme none;

        surfaces
        {
            freeSurf
            {
                type            interface;
                interpolate     false;
            }
        }
    }


// ************************************************************************* //
