run/gasAtomization/system/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         5.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

mergeType points;

scale 0.001;

vertices
(   
    // LV0
    name    p0  (0 0 0)
    name    p1  (15 0 0)
    name    p2  (15 15 0)
    name    p3  (0 15 0)

    //LV1
    name    p4  (0 0 31.4)
    name    p5  (1.25 0 31.4)
    name    p6  (5.525 0 31.4)
    name    p7  (6.9 0 31.4)
    name    p8  (7.6 0 31.4)
    name    p9  (8.48528137423857 0 31.4)
    name    p10 (15 0 31.4)
    name    p11 (15 6 31.4)
    name    p12  (15 15 31.4)
    name    p13 (6 15 31.4)
    name    p14  (0 15 31.4)
    name    p15 (0 8.48528137423857 31.4)
    name    p16 (0 7.6 31.4)
    name    p17 (0 6.9 31.4)
    name    p18 (0 5.525 31.4)
    name    p19 (0 1.25 31.4)
    name    p20 (0.883883476483185 0.883883476483184 31.4)
    
    name    p21 (3.90676496605568 3.90676496605567 31.4)
    name    p22 (4.87903679018718 4.87903679018718 31.4)
    name    p23 (5.37401153701776 5.37401153701776 31.4)
    name    p24 (6 6 31.4)

    //LV 2
    name    p25 (0 0 31.9)
    name    p26 (1.25 0 31.9)
    name    p27 (0.883883476483185 0.883883476483184 31.9)
    name    p28 (0 1.25 31.9)

    //LV 3
    name    p29  (5.525 0 35)
    name    p30  (6.9 0 35)
    name    p31 (7.6 0 35)
    name    p32 (8.48528137423857 0 35)
    name    p33 (15 0 35)
    name    p34 (15 6 35)
    name    p35 (15 15 35)
    name    p36 (6 15 35)
    name    p37 (0 15 35)
    name    p38 (0 8.48528137423857 35)
    name    p39 (0 7.6 35)
    name    p40 (0 6.9 35)
    name    p41 (0 5.525 35)
    name    p42 (3.90676496605568 3.90676496605567 35)
    name    p43 (4.87903679018718 4.87903679018718 35)
    name    p44 (5.37401153701776 5.37401153701776 35)
    name    p45 (6 6 35)

    //LV 4
    name    p46 (7.81719204437598 0 38)
    name    p47 (8.51719204437598 0 38)    
    name    p48 (6.02256425124637 6.02256425124637 38)
    name    p49 (0 8.51719204437598 38)
    name    p50 (0 7.81719204437598 38)
    name    p51 (5.52758950441579 5.52758950441579 38)
    
  
);

// Defining blocks:
blocks
(
    
    hex (p0 p1 p2 p3 p4 p10 p12 p14)        block0  (120 120 251)        simpleGrading   (1 1 1)
    hex (p24 p11 p12 p13 p45 p34 p35 p36)   block1  (72 72 29)    simpleGrading   (1 1 1)
    hex (p15 p24 p13 p14 p38 p45 p36 p37)   block2  (43 72 29)        simpleGrading   (1 1 1)
    hex (p9 p10 p11 p24 p32 p33 p34 p45)    block3  (72 43 29)        simpleGrading   (1 1 1)
    hex (p4 p5 p20 p19 p25 p26 p27 p28)     block4  (10 10 4)  simpleGrading   (1 1 1)
    hex (p18 p21 p22 p17 p41 p42 p43 p40)   block5  (43 11 29)      simpleGrading   (1 1 1)
    hex (p6 p7 p22 p21 p29 p30 p43 p42)     block6  (11 43 29)      simpleGrading   (1 1 1)
    hex (p17 p22 p23 p16 p40 p43 p44 p39)   block7  (43 7 29)          simpleGrading   (1 1 1)
    hex (p7 p8 p23 p22 p30 p31 p44 p43)     block8  (7 43 29)          simpleGrading   (1 1 1)
    hex (p16 p23 p24 p15 p39 p44 p45 p38)   block9  (43 7 29)          simpleGrading   (1 1 1)
    hex (p8 p9 p24 p23 p31 p32 p45 p44)     block10 (7 43 29)          simpleGrading   (1 1 1)
    hex (p40 p43 p44 p39 p50 p51 p48 p49)   block11 (43 7 24)          simpleGrading   (1 1 1)
    hex (p30 p31 p44 p43 p46 p47 p48 p51)   block12 (7 43 24)          simpleGrading   (1 1 1)
);

edges
(

    //LV1
    arc     p15 p24     (3.2471766008772 7.83937778925825 31.4)
    arc     p9  p24     (7.83937778925826 3.24717660087718 31.4)
    arc     p16 p23     (2.9083940859747 7.02148444708577 31.4)
    arc     p8  p23     (7.02148444708578 2.90839408597468 31.4)
    arc     p17 p22     (2.64051568331914 6.37476877432787 31.4)
    arc     p7  p22     (6.37476877432788 2.64051568331912 31.4)
    arc     p18 p21     (2.11432596381713 5.10443441712486 31.4)
    arc     p6  p21     (5.10443441712486 2.11432596381712 31.4)
    arc     p19 p20     (0.478354290456365 1.15484941563911 31.4)
    arc     p5  p20     (1.15484941563911 0.478354290456362 31.4)

    //LV2
    arc     p28 p27     (0.478354290456365 1.15484941563911 31.9)
    arc     p26 p27     (1.15484941563911 0.478354290456362 31.9)

    //LV3
    arc     p38 p45     (3.2471766008772 7.83937778925825 35)
    arc     p32 p45     (7.83937778925826 3.24717660087718 35)
    arc     p39 p44     (2.9083940859747 7.02148444708577 35)
    arc     p31 p44     (7.02148444708578 2.90839408597468 35)
    arc     p40 p43     (2.64051568331914 6.37476877432787 35)
    arc     p30 p43     (6.37476877432788 2.64051568331912 35)
    arc     p41 p42     (2.11432596381713 5.10443441712486 35)
    arc     p29 p42     (5.10443441712486 2.11432596381712 35)

    //LV4
    arc     p50 p51     (2.99150988299889 7.22214373150903 38)
    arc     p46 p51     (7.22214373150903 2.99150988299887 38)
    arc     p49 p48     (3.25938828565446 7.86885940426693 38)
    arc     p47 p48     (7.86885940426694 3.25938828565444 38)
);

defaultPatch
{
	name wall;
	type wall;
}

// Defining patches:
boundary
(
    meltInlet
    {
        type    patch;
        faces
        (
            (p25 p26 p27 p28)
        );
    }

    gasInlet
    {
        type    patch;
        faces
        (
            (p50 p51 p48 p49)
            (p46 p47 p48 p51)
        );
    }

    nozzleWalls
    {
        type    patch;
        faces
        (
            (p45 p34 p35 p36)
            (p38 p45 p36 p37)
            (p32 p33 p34 p45)
            (p39 p44 p45 p38)
            (p31 p32 p45 p44)
            (p41 p42 p43 p40)
            (p42 p29 p30 p43)
            (p18 p21 p42 p41)
            (p21 p6 p29 p42)
            (p40 p43 p51 p50)
            (p43 p30 p46 p51)
            (p39 p49 p48 p44)
            (p31 p44 p48 p47)
            (p19 p28 p27 p20)
            (p5 p20 p27 p26)
        );
    }

    outlet
    {
        type    patch;
        faces
        (
            (p0 p3 p2 p1)
        );
    }

    cylinder
    {
        type    patch;
        faces
        (
            (p2 p3 p14 p12)
            (p1 p2 p12 p10)
            (p12 p13 p36 p35)
            (p11 p12 p35 p34)
            (p13 p14 p37 p36)
            (p10 p11 p34 p33)
        );
    }

    symmetry1
    {
        type            symmetry;
        faces
        (
            (p0 p4 p14 p3)
            (p14 p15 p38 p37)
            (p16 p39 p38 p15)
            (p16 p17 p40 p39)
            (p17 p18 p41 p40)
            (p39 p40 p50 p49)
            (p19 p4 p25 p28)
        );
    }

    symmetry2
    {
        type            symmetry;
		rotationAxis	(0 0 1);
		rotationCentre	(0 0 0);
        faces
        (
            (p0 p1 p10 p4)
            (p9 p10 p33 p32)
            (p8 p9 p32 p31)
            (p7 p8 p31 p30)
            (p6 p7 p30 p29)
            (p30 p31 p47 p46)
            (p4 p5 p26 p25)
        );
    }

    chamberTop
    {
        type    patch;
        faces
        (
            (p4 p10 p12 p14)
        );
    }

    meltInletBottom
    {
        type        patch;
        faces
        (
            
        );
    }

    blockBottom
    {
        type    patch;
        faces
        (
            (p24 p13 p12 p11)
            (p15 p14 p13 p24)
            (p9 p24 p11 p10)
            (p16 p15 p24 p23)
            (p8 p23 p24 p9)
            (p17 p16 p23 p22)
            (p7 p22 p23 p8)
            (p18 p17 p22 p21)
            (p6 p21 p22 p7)
            (p4 p19 p20 p5)
        );
    }

);


mergePatchPairs 
(
    (chamberTop blockBottom)
);
mergeTolerance 1e-5;
// ************************************************************************* //
