run/gasAtomization/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "./initialConditions"

application     compressibleTensileForceInterIsoFoam;

startFrom       latestTime;

startTime       $simStartTime;

stopAt          endTime;

endTime         $simEndTime;

deltaT          0.6e-8;

writeControl    adjustableRunTime;

writeInterval   1;

purgeWrite      0;

writeFormat     binary;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   10;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           0.45;

maxAlphaCo      0.45;

maxDeltaT       1;

functions
{
	
	#include "FOs/FOugas"
	#include "FOs/FOaverages"
	#include "FOs/FOliquidMass"
	#include "FOs/FOextractEulerian"
	#include "FOs/FOwriteObjects"
	#include "FOs/FOvtpsurfaces"

};

libs ("libmyFiniteVolume" "libmyturbulenceModels" "libmyMeshTools" "libmyFieldFunctionObjects" "libmyDynamicFvMesh");
// ************************************************************************* //
