run/gasAtomization/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "./initialConditions"

fluxScheme	    Kurganov;

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    div(phi,alpha)  Gauss vanLeer01;
    div(phirb,alpha) Gauss vanLeer01;
    div(phi,thermo:rho.melt) Gauss linear;
    div(phi,thermo:rho.gas) Gauss linear;

    div(rhoPhi,U)  Gauss limitedLinear 1;
    div(rhoPhi,T)  Gauss upwind;
    div(rhoPhi,K)  Gauss linear;
    div(rhoPhi,k) Gauss linear;
    div(phi,p)      Gauss limitedLinear 1;
    div(phi,k)      Gauss linear;
    
    div(phid1,p_rgh) Gauss limitedLinear 1;
    div(phid2,p_rgh) Gauss limitedLinear 1;

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear orthogonal;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         orthogonal;
}


// ************************************************************************* //
