run/gasAtomization/system/setAlphaFieldDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setAlphaFieldDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
{
   #include "./initialConditions"


field       "alpha.melt";

type	composedFunction;
mode	subtract;
composedFunction
{
	cylinder
	{
		type 	    cylinder;
		radius	    1.25e-3;
		origin	    (0 0 0);
        direction   (0 0 1);
	}
	
    plane
    {
        type        plane;
        origin      (0 0 31.4e-3);
        normal      (0 0 1);
    }
}
}
// ************************************************************************* //
