run/gasAtomization/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "./initialConditions"

defaultFieldValues
();

regions
(
    cylinderToCell
    {
    	p1	    (0 0 55.6e-3);
    	p2	    (0 0 31.4e-3);
        radius  1.25e-3;
    	
    	fieldValues
    	(
    		volScalarFieldValue alphat 0.0
            volScalarFieldValue k 0.0
            volScalarFieldValue nut 0.0
            volScalarFieldValue p_rgh $pAtm
    		volScalarFieldValue p $pAtm
            volScalarFieldValue T $meltInletTemperature
    		volVectorFieldValue U (0 0 -5.1)
    	);
    }
);


// ************************************************************************* //
