run/gasAtomization/system/topoSetDict.gasInlet
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "./initialConditions"

actions
(
    {
        name    gasInletRefinementSet;
        type    cellSet;
        action  new;
        source  cylinderToCell;
        p1      (0 0 31.65e-3);
        p2      (0 0 40e-3);
        radius  8.52e-3;
        innerRadius 5.525e-3;
    }

);

// ************************************************************************* //
